Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_ENETC_PF_TMR.h
#define ENETC_PF_TMR_TMR_CTRL_FS_MASK            (0x10000000U)
#define ENETC_PF_TMR_TMR_CTRL_FS_SHIFT           (28U)
/*! FS - FIPER start indication */
#define ENETC_PF_TMR_TMR_CTRL_FS(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_FS_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_FS_MASK)

#define ENETC_PF_TMR_TMR_CTRL_SHADOW_DIS_MASK    (0x20000000U)
#define ENETC_PF_TMR_TMR_CTRL_SHADOW_DIS_SHIFT   (29U)
/*! SHADOW_DIS - shadow Register disable */
#define ENETC_PF_TMR_TMR_CTRL_SHADOW_DIS(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_SHADOW_DIS_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_SHADOW_DIS_MASK)

#define ENETC_PF_TMR_TMR_CTRL_ALM2P_MASK         (0x40000000U)
#define ENETC_PF_TMR_TMR_CTRL_ALM2P_SHIFT        (30U)
/*! ALM2P - Alarm2 output polarity */
#define ENETC_PF_TMR_TMR_CTRL_ALM2P(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_ALM2P_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_ALM2P_MASK)

#define ENETC_PF_TMR_TMR_CTRL_ALM1P_MASK         (0x80000000U)
#define ENETC_PF_TMR_TMR_CTRL_ALM1P_SHIFT        (31U)
/*! ALM1P - Alarm1 output polarity */
#define ENETC_PF_TMR_TMR_CTRL_ALM1P(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_CTRL_ALM1P_SHIFT)) & ENETC_PF_TMR_TMR_CTRL_ALM1P_MASK)
/*! @} */

/*! @name TMR_TEVENT - Timer Event Register */
/*! @{ */

#define ENETC_PF_TMR_TMR_TEVENT_PP3EN_MASK       (0x20U)
#define ENETC_PF_TMR_TMR_TEVENT_PP3EN_SHIFT      (5U)
#define ENETC_PF_TMR_TMR_TEVENT_PP3EN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_PP3EN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_PP3EN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_PP2EN_MASK       (0x40U)
#define ENETC_PF_TMR_TMR_TEVENT_PP2EN_SHIFT      (6U)
#define ENETC_PF_TMR_TMR_TEVENT_PP2EN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_PP2EN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_PP2EN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_PP1EN_MASK       (0x80U)
#define ENETC_PF_TMR_TMR_TEVENT_PP1EN_SHIFT      (7U)
#define ENETC_PF_TMR_TMR_TEVENT_PP1EN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_PP1EN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_PP1EN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ALM1EN_MASK      (0x10000U)
#define ENETC_PF_TMR_TMR_TEVENT_ALM1EN_SHIFT     (16U)
#define ENETC_PF_TMR_TMR_TEVENT_ALM1EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ALM1EN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ALM1EN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ALM2EN_MASK      (0x20000U)
#define ENETC_PF_TMR_TMR_TEVENT_ALM2EN_SHIFT     (17U)
#define ENETC_PF_TMR_TMR_TEVENT_ALM2EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ALM2EN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ALM2EN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ETS1_THREN_MASK  (0x100000U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS1_THREN_SHIFT (20U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS1_THREN(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ETS1_THREN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ETS1_THREN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ETS2_THREN_MASK  (0x200000U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS2_THREN_SHIFT (21U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS2_THREN(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ETS2_THREN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ETS2_THREN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ETS1EN_MASK      (0x1000000U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS1EN_SHIFT     (24U)
/*! ETS1EN - External trigger 1 new timestamp sample event available */
#define ENETC_PF_TMR_TMR_TEVENT_ETS1EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ETS1EN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ETS1EN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ETS2EN_MASK      (0x2000000U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS2EN_SHIFT     (25U)
/*! ETS2EN - External trigger 2 new timestamp sample event available */
#define ENETC_PF_TMR_TMR_TEVENT_ETS2EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ETS2EN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ETS2EN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ETS1_OVEN_MASK   (0x10000000U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS1_OVEN_SHIFT  (28U)
/*! ETS1_OVEN - External trigger 1 timestamp FIFO Overflow event occurred */
#define ENETC_PF_TMR_TMR_TEVENT_ETS1_OVEN(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ETS1_OVEN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ETS1_OVEN_MASK)

#define ENETC_PF_TMR_TMR_TEVENT_ETS2_OVEN_MASK   (0x20000000U)
#define ENETC_PF_TMR_TMR_TEVENT_ETS2_OVEN_SHIFT  (29U)
/*! ETS2_OVEN - External trigger 2 timestamp FIFO Overflow event occurred */
#define ENETC_PF_TMR_TMR_TEVENT_ETS2_OVEN(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEVENT_ETS2_OVEN_SHIFT)) & ENETC_PF_TMR_TMR_TEVENT_ETS2_OVEN_MASK)
/*! @} */

/*! @name TMR_TEMASK - Timer event mask register */
/*! @{ */

#define ENETC_PF_TMR_TMR_TEMASK_PP3EN_MASK       (0x20U)
#define ENETC_PF_TMR_TMR_TEMASK_PP3EN_SHIFT      (5U)
#define ENETC_PF_TMR_TMR_TEMASK_PP3EN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_PP3EN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_PP3EN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_PP2EN_MASK       (0x40U)
#define ENETC_PF_TMR_TMR_TEMASK_PP2EN_SHIFT      (6U)
#define ENETC_PF_TMR_TMR_TEMASK_PP2EN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_PP2EN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_PP2EN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_PP1EN_MASK       (0x80U)
#define ENETC_PF_TMR_TMR_TEMASK_PP1EN_SHIFT      (7U)
#define ENETC_PF_TMR_TMR_TEMASK_PP1EN(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_PP1EN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_PP1EN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_ALM1EN_MASK      (0x10000U)
#define ENETC_PF_TMR_TMR_TEMASK_ALM1EN_SHIFT     (16U)
#define ENETC_PF_TMR_TMR_TEMASK_ALM1EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ALM1EN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ALM1EN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_ALM2EN_MASK      (0x20000U)
#define ENETC_PF_TMR_TMR_TEMASK_ALM2EN_SHIFT     (17U)
#define ENETC_PF_TMR_TMR_TEMASK_ALM2EN(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ALM2EN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ALM2EN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_ETS1_THREN_MASK  (0x100000U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS1_THREN_SHIFT (20U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS1_THREN(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ETS1_THREN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ETS1_THREN_MASK)

#define ENETC_PF_TMR_TMR_TEMASK_ETS2_THREN_MASK  (0x200000U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS2_THREN_SHIFT (21U)
#define ENETC_PF_TMR_TMR_TEMASK_ETS2_THREN(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_TMR_TMR_TEMASK_ETS2_THREN_SHIFT)) & ENETC_PF_TMR_TMR_TEMASK_ETS2_THREN_MASK)

